app/views/lectures/new.html.erb

      <%= label_tag "Select Lecture Day" %><br>
      <%= f.collection_select(:day_id, Day.all, :id, :date, :prompt => true) %>
---
SELECT "days".* FROM "days"