app/views/pages/lecture.html.erb

SELECT  "days".* FROM "days" WHERE "days"."id" = ?  ORDER BY "days"."id" ASC LIMIT 1  [["id", 1]]
---
      <% if user_signed_in? %>
      <% day = @days.where(id: @lecturesX.day_id).first %>