app/views/pages/schedule.html.erb

<% if !@lecturesPS.empty? %>
  <% day = @days.where(id: @lecturesPS.first.day_id).first %>
---
SELECT  "days".* FROM "days" WHERE "days"."id" = ?  ORDER BY "days"."id" ASC LIMIT 1  [["id", 1]]

              <p><b><%= f.lecture_title %></b></p>
              <% @speakerS = Speaker.where("email = '#{f.key_speaker}'").first %>
---
SELECT  "speakers".* FROM "speakers" WHERE (email = 'tzhang28@sheffield.ac.uk')  ORDER BY "speakers"."id" ASC LIMIT 1