app/controllers/days_controller.rb

SELECT  "days".* FROM "days" WHERE "days"."id" = ? LIMIT 1  [["id", 1]]
SELECT "days".* FROM "days"
---
    def show
      @day = Day.find(params[:id])
      @days = Day.all

INSERT INTO "days" ("date", "name", "display_size", "ddatey", "ddatem", "ddated", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @day = Day.new(day_params)
      dayv = day_params[:date]
      puts dayv
      dayd = dayv.split('/')[0]
      daym = dayv.split('/')[1]
      dayy = dayv.split('/')[2]
      @day.ddatey = dayy
      @day.ddatem = daym
      @day.ddated = dayd
      if @day.save