app/controllers/lectures_controller.rb

  def index
    @lectures = Lecture.all
---
SELECT "lectures".* FROM "lectures"

  def create
    @speakers = Speaker.all
    @lecture = Lecture.new(lecture_params)

    if @lecture.save
---
INSERT INTO "lectures" ("lecture_title", "is_break", "day_id", "column_name", "start_time", "end_time", "location", "key_speaker", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)