app/controllers/pages_controller.rb

  def index
    #@spksize = Speaker.where("to_display = 1").count
    @spksize = User.where("role = 'Default'").count
    #@att = User.count
    @speakerF = Speaker.take(4)
    @frontpv = Frontpv.first
---
SELECT COUNT(*) FROM "users" WHERE (role = 'Default')
SELECT  "speakers".* FROM "speakers" LIMIT 4
SELECT  "frontpvs".* FROM "frontpvs"  ORDER BY "frontpvs"."id" ASC LIMIT 1

  def lecture
    authorize! :lecture, :home
    @lecturesX = Lecture.find(params[:id])

    @speakerS = Speaker.where("email = '#{@lecturesX.key_speaker}'").first
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "speakers".* FROM "speakers" WHERE (email = 'tzhang28@sheffield.ac.uk')  ORDER BY "speakers"."id" ASC LIMIT 1

  def schedule
    authorize! :schedule, :home
    @days = Day.all
    @lectures1=Lecture.order(start_time: :asc).where("day_id = ? AND column_name = ?", params[:time], 'Splitting')
---
SELECT  "days".* FROM "days" WHERE (1)  ORDER BY "days"."id" ASC LIMIT 1
SELECT  "lectures".* FROM "lectures" WHERE (day_id = '1' AND column_name = 'Enabling')  ORDER BY "lectures"."start_time" ASC LIMIT 1

  def speaker
    authorize! :speaker, :home

    if params[:id].present?
      @speakerX = Speaker.find(params[:id])
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = ? LIMIT 1  [["id", 1]]

  def days
    authorize! :days, :home
    @days = Day.all
---
SELECT "days".* FROM "days"

  def speakers
    authorize! :speakers, :home
    @speakerA = Speaker.all
---
SELECT "speakers".* FROM "speakers"

  def biography
    authorize! :biography, :home
    @speaker = Speaker.find_by_email(current_user.email)
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."email" = ? LIMIT 1  [["email", "admin@example.com"]]

  def biography_update
    authorize! :biography_update, :home
    @speaker = Speaker.find_by_email(current_user.email)
    if @speaker.update(biography_params)
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."email" = ? LIMIT 1  [["email", "admin@example.com"]]
UPDATE "speakers" SET "to_display" = ?, "speaker_title" = ?, "forename" = ?, "surname" = ?, "organisation" = ?, "display_email" = ?, "biography" = ?, "academic_background" = ?, "website" = ?, "facebook" = ?, "twitter" = ?, "linkedIn" = ?, "avatar" = ?, "updated_at" = ? WHERE "speakers"."id" = ?