app/controllers/speakers_controller.rb

  def speakers
    @speakers = Speaker.all
---
SELECT "speakers".* FROM "speakers"

  def index
    @speakers = Speaker.all
---
SELECT "speakers".* FROM "speakers"

  def edit
    @speaker = Speaker.find(params[:id])
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = ? LIMIT 1  [["id", 1]]

  def update
  @speaker = Speaker.find(params[:id])
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = ? LIMIT 1  [["id", 1]]