app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.password = ('a'..'z').to_a.shuffle[0,8].join
    if @user.save
      # Tell the RegistrationMailer to send a welcome email after save
      @speaker = Speaker.new(:email => user_params[:email],:to_display => "0")
      if @speaker.save
---
INSERT INTO "users" ("email", "role", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "speakers" ("email", "to_display", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "tzhang28@sheffield.ac.uk"], ["to_display", "0"], ["created_at", "2016-05-17 10:30:22.779304"], ["updated_at", "2016-05-17 10:30:22.779304"]]

  def destroy
     if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]

  def find_user_from_params
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]